import { getApiBaseUrl } from "../../../utils/apiUtils";

export interface ApiConfig {
  apiUrl: string; // URL для API
  defaultData: Record<string, Record<string, string | number>>; // Дефолтные данные
  titles: Record<string, string>; // Заголовки таблиц
  displayNames: Record<string, Record<string, string>>; // Сопоставление названий
}

const apiBaseUrl = getApiBaseUrl(); // Получаем базовый URL

export const apiConfigs: Record<string, ApiConfig> = {
  sushilka1: {
    apiUrl: `${apiBaseUrl}/api/sushilka1-data`,
    defaultData: {
      temperatures: {
        "Температура в топке": "—",
        "Температура в камере смешения": "—",
        "Температура уходящих газов": "—",
      },
      vacuums: {
        "Разрежение в топке": "—",
        "Разрежение в камере выгрузки": "—",
        "Разрежение воздуха на разбавление": "—",
      },
      gorelka: {
        "Мощность горелки №1": "—",
        "Сигнал от регулятора №1": "—",
        "Задание температуры №1": "—",
      },
    },
    titles: {
      temperatures: "Текущие параметры (температура)",
      vacuums: "Текущие параметры (разрежения)",
      gorelka: "Текущие параметры (горелка)",
    },
    displayNames: {
      temperatures: {
        "Температура в топке": "В топке",
        "Температура в камере смешения": "В камере смешения",
        "Температура уходящих газов": "Уходящих газов", 
      },
      vacuums: {
        "Разрежение в топке": "Разрежение в топке",
        "Разрежение в камере выгрузки": "В камере выгрузки",
        "Разрежение воздуха на разбавление": "Воздуха на разбавление",
      },
      gorelka: {
        "Мощность горелки №1": "Мощность горелки, %",
        "Сигнал от регулятора №1": "Сигнал регулятора, %",
        "Задание температуры №1": "Задание температуры",
      },
    }
  },


  sushilka2: {
    apiUrl: `${apiBaseUrl}/api/sushilka2-data`,
    defaultData: {
      temperatures: {
        "Температура в топке": "—",
        "Температура в камере смешения": "—",
        "Температура уходящих газов": "—",
      },
      vacuums: {
        "Разрежение в топке": "—",
        "Разрежение в камере выгрузки": "—",
        "Разрежение воздуха на разбавление": "—",
      },
      gorelka: {
        "Мощность горелки №2": "—",
        "Сигнал от регулятора №2": "—",
        "Задание температуры №2": "—",
      },
    },
    titles: {
      temperatures: "Текущие параметры (температура)",
      vacuums: "Текущие параметры (разрежения)",
      gorelka: "Текущие параметры (горелка)",
    },
    displayNames: {
      temperatures: {
        "Температура в топке": "В топке",
        "Температура в камере смешения": "В камере смешения",
        "Температура уходящих газов": "Уходящих газов",
      },
      vacuums: {
        "Разрежение в топке": "Разрежение в топке",
        "Разрежение в камере выгрузки": "В камере выгрузки",
        "Разрежение воздуха на разбавление": "Воздуха на разбавление",
      },
      gorelka: {
        "Мощность горелки №2": "Мощность горелки, %",
        "Сигнал от регулятора №2": "Сигнал от регулятора, %",
        "Задание температуры №2": "Задание температуры",
      },
    }
  },
  
};
